unit4/tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        tweet = Tweet.new(tweet_params)

    if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "\"hey this works wahoo\""], ["content", "\"homework is so awesome\""], ["author", "\"me\""]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "author" = $2, "content" = $3 WHERE "tweets"."id" = $4  [["title", "\"wahoo\""], ["author", "\"me\""], ["content", "\"homework is so awesome\""], ["id", 3]]

    def destroy
        tweet = Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 14]]